---
kind: method
id: M:Autodesk.Revit.DB.WorksetTable.Dispose
source: html/ed0690b7-c537-9e6a-6e71-d8b8f0941f92.htm
---
# Autodesk.Revit.DB.WorksetTable.Dispose Method

Releases all resources used by the WorksetTable

## Syntax (C#)
```csharp
public void Dispose()
```